{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "trainable": true, "nb_row": 3, "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "bias": true, "nb_col": 3, "name": "convolution2d_5", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "trainable": true, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "bias": true, "nb_col": 3, "name": "convolution2d_6", "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense_7", "trainable": true, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 512, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_8", "trainable": true, "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 43, "bias": true}}], "keras_version": "1.1.2"}